#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/NextOps/unifi-controller/runs/run-C3j7Z4FWHWFz6sAs

Waiting for the plan to start...

Terraform v1.1.9
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_app.unifi-controller will be created
  + resource "digitalocean_app" "unifi-controller" {
      + active_deployment_id = (known after apply)
      + created_at           = (known after apply)
      + default_ingress      = (known after apply)
      + id                   = (known after apply)
      + live_url             = (known after apply)
      + updated_at           = (known after apply)

      + spec {
          + domains = (known after apply)
          + name    = "unifi-controller"
          + region  = "sfo"

          + domain {
              + name     = (known after apply)
              + type     = (known after apply)
              + wildcard = (known after apply)
              + zone     = (known after apply)
            }

          + service {
              + http_port          = (known after apply)
              + instance_count     = 1
              + instance_size_slug = "basic-xxs"
              + name               = "linuxserver-unifi-controller"
              + run_command        = (known after apply)

              + image {
                  + registry      = "linuxserver"
                  + registry_type = "DOCKER_HUB"
                  + repository    = "unifi-controller"
                  + tag           = "7.0.25"
                }

              + routes {
                  + path                 = (known after apply)
                  + preserve_path_prefix = (known after apply)
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @awaddell, Action: `pull_request`*